{"code": "CVC 21453(a)", "title": "Red Light Violation", "description": "A driver facing a steady circular red signal alone shall stop at a marked limit line, but if none, before entering the crosswalk on the near side of the intersection or, if none, then before entering the intersection, and shall remain stopped until an indication to proceed is shown.", "category": "traffic_signals"}
{"code": "CVC 21801(a)", "title": "Left Turn Yield", "description": "The driver of a vehicle intending to turn to the left or to complete a U-turn upon a highway, or to turn left into public or private property, or an alley, shall yield the right-of-way to all vehicles approaching from the opposite direction which are close enough to constitute a hazard at any time during the turning movement.", "category": "right_of_way"}
{"code": "CVC 21802(a)", "title": "Stop Sign Violation", "description": "The driver of any vehicle approaching a stop sign at the entrance to, or within, an intersection shall stop at a limit line, if marked, otherwise before entering the crosswalk on the near side of the intersection. If there is no limit line or crosswalk, the driver shall stop at the entrance to the intersecting roadway.", "category": "traffic_control"}
{"code": "CVC 21950(a)", "title": "Pedestrian Right-of-Way in Crosswalk", "description": "The driver of a vehicle shall yield the right-of-way to a pedestrian crossing the roadway within any marked crosswalk or within any unmarked crosswalk at an intersection.", "category": "pedestrian_safety"}
{"code": "CVC 22350", "title": "Basic Speed Law", "description": "No person shall drive a vehicle upon a highway at a speed greater than is reasonable or prudent having due regard for weather, visibility, the traffic on, and the surface and width of, the highway, and in no event at a speed which endangers the safety of persons or property.", "category": "speed"}
{"code": "CVC 22107", "title": "Unsafe Lane Change", "description": "No person shall turn a vehicle from a direct course or move right or left upon a roadway until such movement can be made with reasonable safety and then only after the giving of an appropriate signal.", "category": "lane_changes"}
{"code": "CVC 21658(a)", "title": "Lane Straddling", "description": "Whenever any roadway has been divided into two or more clearly marked lanes for traffic in one direction, a vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.", "category": "lane_usage"}
{"code": "CVC 21703", "title": "Following Too Closely", "description": "The driver of a motor vehicle shall not follow another vehicle more closely than is reasonable and prudent, having due regard for the speed of such vehicle and the traffic upon, and the condition of, the roadway.", "category": "following_distance"}
{"code": "CVC 21804(a)", "title": "Entering Highway from Private Road", "description": "The driver of any vehicle about to enter or cross a highway from any public or private property, or from an alley, shall yield the right-of-way to all traffic, as defined in Section 620, approaching on the highway close enough to constitute an immediate hazard.", "category": "right_of_way"}
{"code": "CVC 22526", "title": "Unsafe Speed for Conditions", "description": "Notwithstanding any speed limit, no person may drive a vehicle at a speed that is not reasonable or prudent with due regard for visibility, traffic conditions, the surface and width of the highway, and in no event at a speed that endangers the safety of persons or property.", "category": "speed"}
{"code": "CVC 21800(a)", "title": "Right-of-Way at Intersection", "description": "The driver of a vehicle approaching an intersection shall yield the right-of-way to any vehicle which has entered the intersection from a different highway.", "category": "right_of_way"}
{"code": "CVC 21451(a)", "title": "Green Signal Proceed", "description": "A driver facing a circular green signal shall proceed straight through or turn right or left or make a U-turn unless a sign prohibits a U-turn. Any driver, including one turning, shall yield the right-of-way to other traffic and to pedestrians lawfully within the intersection.", "category": "traffic_signals"}
{"code": "CVC 23103(a)", "title": "Reckless Driving", "description": "A person who drives a vehicle upon a highway in willful or wanton disregard for the safety of persons or property is guilty of reckless driving.", "category": "dangerous_driving"}
{"code": "CVC 21752(a)", "title": "Passing Without Sufficient Clearance", "description": "No vehicle shall be driven to the left side of the roadway when approaching or upon the crest of a grade or a curve in the highway where the driver's view is obstructed within such distance as to create a hazard in the event another vehicle might approach from the opposite direction.", "category": "passing"}
{"code": "CVC 22100", "title": "Illegal Turning Movements", "description": "Except as provided in Section 22100.5 or 22101, the driver of any vehicle intending to turn upon a highway shall do so only from the appropriate lane, as determined by traffic control devices or road markings.", "category": "turning"}
{"code": "CVC 21650(a)", "title": "Right Side of Road", "description": "Upon all highways, a vehicle shall be driven upon the right half of the roadway, except when overtaking and passing another vehicle, when placing a vehicle in position for and when such vehicle is lawfully making a left turn, or when the right half of a roadway is closed to traffic.", "category": "lane_usage"}
{"code": "CVC 21801(b)", "title": "Left Turn Across Path", "description": "A driver having yielded as prescribed in subdivision (a) of CVC 21801, and having given a signal when and as required by this code, may turn left or complete a U-turn, and the drivers of vehicles approaching the intersection from said opposite direction shall yield the right-of-way to the vehicle making the left turn or U-turn.", "category": "right_of_way"}
{"code": "CVC 22450(a)", "title": "Stop Sign Requirements", "description": "The driver of any vehicle approaching a stop sign at the entrance to, or within, an intersection, or at any other place where a stop sign is erected, shall stop as required by Section 21802.", "category": "traffic_control"}
{"code": "CVC 21954(a)", "title": "Pedestrian Outside Crosswalk", "description": "Every pedestrian upon a roadway at any point other than within a marked crosswalk or within an unmarked crosswalk at an intersection shall yield the right-of-way to all vehicles upon the roadway so near as to constitute an immediate hazard.", "category": "pedestrian_safety"}
{"code": "CVC 22109", "title": "Signal Before Turning", "description": "No person shall stop or suddenly decrease the speed of a vehicle on a highway without first giving an appropriate signal in the manner provided in this chapter to the driver of any vehicle immediately to the rear when there is opportunity to give the signal.", "category": "signaling"}
